app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "health"], ["created_at", "2015-10-10 12:34:50.003935"], ["updated_at", "2015-10-10 12:34:50.003935"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save