app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"